# Create Method (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
AreaLoad..::..Create Method
AreaLoad Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), XYZ, AreaLoadType) | Creates a new non-hosted area load within the project. |
| Create(Document, IList<(Of <<'(CurveLoop>)>>), IList<(Of <<'(XYZ>)>>), IList<(Of <<'(Int32>)>>), IList<(Of <<'(Int32>)>>), AreaLoadType) | Creates a new non-hosted area load within the project. |

# See Also
AreaLoad Class
AreaLoad Members
Autodesk.Revit.DB.Structure Namespace